[Archetypes.ARC_IA_ElevatorPowerControl XComInteractiveLevelActor]
FriendlyDisplayName="Elevator Power Console"

[Archetypes.ARC_IA_LastGift XComInteractiveLevelActor]
FriendlyDisplayName="Elevator Control Station"

[Archetypes.ARC_IA_LastGift_AtmosphericComputer XComInteractiveLevelActor]
FriendlyDisplayName="Atmospheric Control Computer"

[Archetypes.ARC_IA_LastGift_ElevatorComputer XComInteractiveLevelActor]
FriendlyDisplayName="Elevator Power Control"

[Archetypes.ARC_IA_LastGift_ElevatorLocation XComInteractiveLevelActor]
FriendlyDisplayName="Elevator Hook"

[Archetypes.ARC_IA_SkybridgeComputerStation XComInteractiveLevelActor]
FriendlyDisplayName="Skybridge Computer"

[Archetypes.ARC_IA_SkybridgeComputerStation_Roof XComInteractiveLevelActor]
FriendlyDisplayName="Skybridge Computer"

[Archetypes.ARC_IA_SparkActivation XComInteractiveLevelActor]
FriendlyDisplayName="Spark"

